In [ ]:
CREATE TABLE friends (
  id INTEGER,
  name TEXT,
  birthday DATE
);

In [ ]:
INSERT INTO friends (id, name, birthday)
VALUES (1, 'Jane Doe', '1990-05-30');
INSERT INTO friends (id, name, birthday)
VALUES (2, 'John Smith', '1988-01-15');
INSERT INTO friends (id, name, birthday)
VALUES (3, 'Bill Doe', '1992-07-05');

In [ ]:
UPDATE friends
SET name = 'Jane Smith'
WHERE id = 1;

In [ ]:
ALTER TABLE friends
ADD COLUMN email TEXT;

In [ ]:
UPDATE friends
SET email = 'jane@codecademy.com'
WHERE id = 1;
UPDATE friends
SET email = 'John@codecademy.com'
WHERE id = 2;
UPDATE friends
SET email = 'bill@codecademy.com'
WHERE id = 3;

In [ ]:
DELETE FROM friends
WHERE id = 1;

In [ ]:
SELECT * FROM friends;